app/views/pages/show.html.erb

SELECT "pages".* FROM "pages"  WHERE 1=0  ORDER BY (case when pages.ancestry is null then 0 else 1 end), pages.ancestry
---
<ul id="menu">
  <% Page.roots.each do |page| %>