app/controllers/pages_controller.rb

    def set_page
      @page = Page.find_by_slug(params[:id].split('/').last)
---
SELECT  "pages".* FROM "pages"  WHERE "pages"."slug" = '1-product' LIMIT 1