app/controllers/pages_controller.rb

  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("ancestry", "content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ancestry", "2"], ["content", "yo"], ["created_at", "2014-07-12 07:11:48.550441"], ["name", "Baozi"], ["updated_at", "2014-07-12 07:11:48.550441"]]

  def update
    respond_to do |format|
      if @page.update(page_params)
---
UPDATE "pages" SET "content" = ?, "updated_at" = ? WHERE "pages"."id" = 1  [["content", "frfrfrfrf"], ["updated_at", "2014-07-12 07:25:17.742718"]]

    def set_page
      @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages"  WHERE "pages"."id" IN (2)  ORDER BY (case when pages.ancestry is null then 0 else 1 end), pages.ancestry